import Workpack.funtionwat 

try :
    # รับค่า ซื้อกี่รอบ เริ่มหุ้นกี่ตัว ราคาที่ซื้อแต่ละรอบ จุดขาดทุน จุดกำไร
    main={"รอบที่ซื้อ":0,"ซื้อเริ่มต้น":0,"ราคาหุ้นเฉลี่ยหลังคิดภาษี":0,
          "ใช้เงินไปทั้งหมด":0,"ซื้อได้ทั้งหมด":0,"ขาดทุนทั้งหมด":0,
          "กำไรทั้งหมด":0,"ขาดทุน%":0,"กำไร%":0,"ภาษีมูลค่าเพิ่ม":0,
          "ราคาหุ้นเฉลี่ยก่อนคิดภาษี":0,"SL":0,"TP":0,"RR":0
          }
    price=[] # จะเป็นตัวกำหนดว่า ซื้อกี่รอบ ซื้อที่ราคาเท่าไหร่ ตามลำดับ p
    many_stonk=[] #จำนวนหุ้นแต่ละรอบ q
    tr=[] # TR= P*Q
    
    print("กรุณากรอกราคาหุ้นที่ต้องการซื้อในแต่ละรอบ"+"\n"+"เมื่อกรอกเสร็จแล้วให้พิมพ์คำว่า Yes")
    while True : # นำเข้า ราคาหุ้น
        x=(input("ซื้อหุ้นที่ราคากี่บาท :"))
        if x == "Yes" :
            break
        x=float(x)
        price.append(x)  
    main["รอบที่ซื้อ"]=len(price)
    main["ซื้อเริ่มต้น"]=float(input("ซื้อครั้งแรกกี่หุ้น :")) # นำเข้า ซื้อเริ่มต้น
    
    # ก่อนทำฟังก์ชั่น ต้องรับค่าก่อนนน
    main["ซื้อได้ทั้งหมด"]=Workpack.funtionwat.sum_stonk_all(main["รอบที่ซื้อ"],main["ซื้อเริ่มต้น"]) # จะได้จำนวนหุ้นทั้งหมด
    many_stonk=Workpack.funtionwat.sum_many_stonk(main["รอบที่ซื้อ"],main["ซื้อเริ่มต้น"]) # จะได้จำนวนหุ้นที่ต้องซื้อในแต่ละรอบ
    for i in range(len(price)): # p*q ดึงมาทีละตัวแล้วเก็บค่าไปที่ใหม่
        tr.append(price[i]*many_stonk[i])
    main["ใช้เงินไปทั้งหมด"]=Workpack.funtionwat.sum_ma(tr)
    
    # ราคาเฉลี่ยหาได้จาก เงินที่ใช้ทั้งหมด/จำนวนหุ้นทั้งหมด
    main["ราคาหุ้นเฉลี่ยก่อนคิดภาษี"]=main["ใช้เงินไปทั้งหมด"]/main["ซื้อได้ทั้งหมด"] 
    main["ภาษีมูลค่าเพิ่ม"]=main["ราคาหุ้นเฉลี่ยก่อนคิดภาษี"]*(0.125/100)
    main["ราคาหุ้นเฉลี่ยหลังคิดภาษี"]=main["ราคาหุ้นเฉลี่ยก่อนคิดภาษี"]+main["ภาษีมูลค่าเพิ่ม"]
    main["SL"]=float(input("กำหนดราคาขาดทุน :"))
    main["TP"]=float(input("กำหนดราคาเป้าหมาย :"))
    
    # ขาดทุนทั้งหมดหาได้จาก ใช้เงินไปทั้งหมด - (SL*จำนวนหุ้นทั้งหมด)
    main["ขาดทุนทั้งหมด"] = main["ราคาหุ้นเฉลี่ยหลังคิดภาษี"]*main["ซื้อได้ทั้งหมด"] - (main["SL"]*main["ซื้อได้ทั้งหมด"])
    main["กำไรทั้งหมด"] = (main["TP"]*main["ซื้อได้ทั้งหมด"]) - main["ราคาหุ้นเฉลี่ยหลังคิดภาษี"]*main["ซื้อได้ทั้งหมด"] 
    
    # % กำไรขาดทุน = กำไรขาดทุน / ซื้อไปเท่าไหร่ *100
    main["กำไร%"] = (main["กำไรทั้งหมด"] / main["ใช้เงินไปทั้งหมด"])*100
    main["ขาดทุน%"] = (main["ขาดทุนทั้งหมด"] / main["ใช้เงินไปทั้งหมด"])*100
    main["RR"]=main["กำไรทั้งหมด"]/main["ขาดทุนทั้งหมด"]
    #print(main,"\n","ราคา",price,"\n","จำนวนหุ้นในแต่ละรอบ",many_stonk,"\n","TR แต่ละรอบ",tr) # debug
    
    # สิ่งที่อยากให้ออกมา ราคาหุ้นเฉลี่ยหลังคิดภาษี ใช้เงินไปทั้งหมดเท่าไหร่ ซื้อได้กี่หุ้น ขาดทุนกี่บาท + % กำไรกี่ + %    
    
    # แสดงผลลงไปในกระดาษ
    text=Workpack.funtionwat.createtext(price,many_stonk,main["SL"],main["TP"],main["ซื้อเริ่มต้น"],main["ราคาหุ้นเฉลี่ยหลังคิดภาษี"],main["ใช้เงินไปทั้งหมด"],main["ขาดทุนทั้งหมด"],main["ขาดทุน%"],main["กำไรทั้งหมด"],main["กำไร%"],main["RR"]) # จัดรูปแบบแสดงผล
    create_name_file_input=input("ตั้งชื่อไฟล์ของคุณ :")+".text" # ถามผู้ใช้ตั้งชื่อไฟล์
    Workpack.funtionwat.writetext(create_name_file_input,text) # สร้างไฟล์ text
    # สิ่งที่ยังไม่สมบูรณ์ ยังไม่ได้เก็บเงินที่ใช้ไปทั้งหมดหลังคิดภาษี
except Exception as e:
    print(e)


